```
Terraform will perform the following actions:

  # azurerm_storage_share.ldap will be created
  + resource "azurerm_storage_share" "ldap" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "ldap"
      + quota                = 5120
      + resource_manager_id  = (known after apply)
      + storage_account_name = "ldapjenkinsiobackups"
      + url                  = (known after apply)

      + acl {
          + id = "MTIzN<...>MTI"

          + access_policy {
              + expiry      = "2019-07-02T10:38:21.0000000Z"
              + permissions = "rwdl"
              + start       = "2019-07-02T09:38:21.0000000Z"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```